In [1]:
d={"Name":("belal ahmed","belal sidiqui","belal mohd","belal khan","belal kon")}

In [2]:
import pandas as pd
df=pd.DataFrame(d)

In [3]:
d

{'Name': ('belal ahmed',
  'belal sidiqui',
  'belal mohd',
  'belal khan',
  'belal kon')}

In [4]:
df

            Name
0    belal ahmed
1  belal sidiqui
2     belal mohd
3     belal khan
4      belal kon

In [7]:
df["first"]=df["Name"].apply(lambda s:s.split()[0])

In [8]:
df

            Name  first
0    belal ahmed  belal
1  belal sidiqui  belal
2     belal mohd  belal
3     belal khan  belal
4      belal kon  belal